clear all
A=[15 2 3 -2;2 13 -5 3;3 -5 11 2;-2 3 2 14]
b=[5;7;-10;-3]
%вычислить значение определителя det A
D=det(A)
%вычислить собственные значения ?i, i = 1, n матрицы A;
d = eig(A)
%найти границы спектра матрицы A
MAXd=max(d)
MINd=min(d)
%вычислить спектральный радиус матрицы A
R=max(abs(d))
%найти обратную матрицу
A1=inv(A)
%найти решение x? линейной системы Ax = b
x=b\A
%вычислить ?x???
n1=norm(x,'inf')
nn1=max(abs(x))
%вычислить ?A?2
n2=norm(A,2)
nn2=max(sqrt(eig(A'*A)))
%вычислить ?x??1
n3=norm(x,1)
nn3=sum(abs(x))
%вычислить ?x??2
n4=norm(x,2)
u=[x(1)^2;x(2)^2;x(3)^2;x(4)^2]
nn4=sqrt(sum(u))
%вычислить ?A?F;
NF=norm(A,'fro')
D=[A(1,1)^2 A(1,2)^2 A(1,3)^2 A(1,4)^2; A(2,1)^2 A(2,2)^2 A(2,3)^2 A(2,4)^2; A(3,1)^1 A(3,2)^2 A(3,3)^2 A(3,4)^2; A(4,1)^2 A(4,2)^2 A(4,3)^2 A(4,4)^2]
NNF=sqrt(sum(sum(D)))
% вычислить матрицу H, задаваемую формулой H = E ? (2\<b,b>)*bb^T,где E –единичная матрица
H=eye-(2/(b'*b))*(b*b')
